Repository: biblibre/omeka-s-module-Solr
Catalog: language/*.po
Languages: fr

source: Relevance
fr: Pertinence

source: contains any word
fr: contient au moins un des mots

source: contains all words
fr: contient tous les mots

source: contains expression
fr: contient l'expression

source: matches pattern
fr: correspond au motif

source: %d mappings were found and imported
fr: %d correspondances ont été trouvées et importées

source: Resource name field
fr: Champ 'nom de la ressource'

source: Name of Solr field that will contain the resource name (or resource type, e.g. "items", "item_sets", ...). It must be a single-valued, string-based field. WARNING: Changing this will require a complete reindexation.
fr: Le nom du champ Solr qui contiendra le nom de la ressource (ou son type, par exemple "items", "item_sets", ...). Ce doit être un champ non multi-valué, de type chaîne de caractères (string). ATTENTION: Modifier ce paramètre nécessitera une réindexation complète.

source: Sites field
fr: Champ Sites

source: Name of Solr field that will contain the sites ids. It must be a single-valued, integer-based field. WARNING: Changing this will require a complete reindexation.
fr: Le nom du champ Solr qui contiendra les identifiants de sites. Le champ doit être à valeur unique, et de type entier. ATTENTION : Modifier ceci nécessitera une réindexation complète.

source: Is Public field
fr: Champ isPublic

source: Name of the Solr field that will contain the isPublic flag. It must be a single-valued, boolean-based field. WARNING: Changing this will require a complete reindexation.
fr: Le nom du champ Solr qui contiendra la valeur de l'option "public". Le champ doit être à valeur unique, et de type booléen. ATTENTION : Modifier ceci nécessitera une réindexation complète.

source: Query fields
fr: Champs de requête

source: qf parameter that will be added to the query
fr: paramètre qf qui sera ajouté à la requête

source: mm parameter that will be added to the query
fr: paramètre mm qui sera ajouté à la requête

source: Highlighting
fr: Mise en évidence

source: Enable extract retrieval in relation to search terms
fr: Activer la récupération d'extraits par rapport aux termes de recherche

source: Highlight fields
fr: Liste des champs concernés par la mise en évidence

source: Fields used for highligthing feature (use "*" for all fields).
fr: La fonctionalité de mise en évidence (utilisez "*" pour tous les champs).

source: Highlight fragment size
fr: La taille des extraits de mise en évidence

source: Define number of caracters for the fragment size of highlight, 0 will show the entire field value.
fr: Définissez le nombre de caractères pour la taille des extraits de mise en évidence, 0 affichera la valeur entière du champ.

source: Highlight snippets
fr: Extraits mis en évidence

source: Define the number of fragments where the search terms were found in the same field.
fr: Définissez le nombre d'extraits dans lesquels les termes de recherche ont été trouvés dans le même champ.

source: The name will be used internally before being translated to the Solr field name. It will also be available in queries to search on this specific field. It should contain only alphanumeric characters and underscore, and should not start with a digit.
fr: Le nom sera utilisé en interne avant d'être traduit en nom de champ Solr. Il sera aussi disponible dans les requêtes pour chercher sur un champ spécifique. Il doit contenir uniquement des caractères alphanumériques et le tiret bas, et ne doit pas commencer par un chiffre.

source: The label is the human-friendly version of the name
fr: Le libellé est destiné à l'affichage dans l'interface

source: Text fields
fr: Champs de type texte

source: A space-separated list of Solr fields which will be used when a search needs to be performed on text fields. Leave empty to forbid text search on this field.
fr: Une liste séparée par des espaces de champs Solr qui seront utilisés lorsque une recherche doit être effectuée sur des champs de type texte. Laisser vide pour interdire la recherche de type texte sur ce champ.

source: String fields
fr: Champs de type chaîne

source: A space-separated list of Solr fields which will be used when a search needs to be performed on string fields. Leave empty to forbid string search on this field.
fr: Une liste séparée par des espaces de champs Solr qui seront utilisés lorsque une recherche doit être effectuée sur des champs de type chaîne. Laisser vide pour interdire la recherche de type chaîne sur ce champ.

source: Facet field
fr: Champ de facette

source: The Solr field which will be used for faceting. Leave empty to forbid faceting on this field.
fr: Le champ Solr qui sera utilisé pour les facettes. Laisser vide pour interdire les facettes sur ce champ.

source: Sort field
fr: Champ de tri

source: The Solr field which will be used for sorting. Leave empty to forbid sorting on this field.
fr: Le champ Solr qui sera utilisé pour le tri. Laisser vide pour interdire le tri sur ce champ.

source: Add Solr mapping
fr: Ajouter une correspondance Solr

source: Solr mapping for %s
fr: Configuration Solr pour %s

source: Add new mapping
fr: Ajouter une correspondance Solr

source: Back to resources list
fr: Retour à la liste des ressources

source: Solr field
fr: Champ Solr

source: There is no mappings defined yet.
fr: Il n'y a pas de correspondances définies pour l'instant.

source: Solr mapping
fr: Configuration Solr

source: Import mappings
fr: Importer des correspondances

source: Back to nodes list
fr: Retour à la liste des noeuds

source: Rules
fr: Règles

source: Edit Solr mapping
fr: Modifier la correspondance Solr

source: Solr mapping import
fr: Import de correspondance Solr

source: Mapping details
fr: Détails de correspondance

source: Add Solr node
fr: Ajouter un noeud Solr

source: Solr configuration
fr: Configuration de Solr

source: Add new node
fr: Ajouter un noeud Solr

source: Configure indexation fields
fr: Configurer les champs d'indexation

source: Configure search fields
fr: Configurer les champs de recherche

source: Edit Solr node
fr: Modifier le noeud Solr

source: Add search field
fr: Ajouter un champ de recherche

source: Search fields (%s)
fr: Champs de recherche (%s)

source: Label (name)
fr: Libellé (nom)

source: There is no fields defined yet.
fr: Il n'y a pas de champs défini pour l'instant.

source: Edit search field
fr: Modifier le champ de recherche

source: Configure transformation
fr: Configurer la transformation

source: Save transformation
fr: Enregistrer la transformation

source: Transformation to be removed
fr: Transformation à supprimer

source: Remove transformation
fr: Supprimer la transformation

source: Restore transformation
fr: Restaurer la transformation

source: Username
fr: Nom d'utilisateur

source: The username used for HTTP Authentication, if any
fr: Le nom d'utilisateur utilisé pour l'authentification HTTP, le cas échéant

source: The HTTP Authentication password
fr: Le mot de passe d'authentification HTTP

source: Groups field
fr: Champ de groupes

source: Name of the Solr field that will contain the groups ids. It must be a multi-valued, integer-based field.<br>Only useful if the module Group is enabled<br><strong>WARNING: Changing this will require a complete reindexation</strong>
fr: Le nom du champ Solr qui contiendra les identifiants de groupes. Le champ doit être à valeur multiple, et de type entier.<br>Utile uniquement si le module Group est activé<br><strong>ATTENTION : Modifier ceci nécessitera une réindexation complète</strong>

source: Maximum characters analyzed
fr: Nombre maximum de caractères analysés

source: Set the value of hl.maxAnalyzedChars parameter. Great values can have impact on performance
fr: Définissez la valeur du paramètre hl.maxAnalyzedChars. Des valeurs élevées peuvent avoir un impact sur les performances

source: URL of a JSON-LD representation of Solr mappings, like returned by Omeka S REST API (eg. https://omeka-s/api/solr_mappings?solr_node_id=1)
fr: L'URL d'une représentation JSON-LD de correspondances Solr, comme retournée par l'API REST d'Omeka S (ex. https://omeka-s/api/solr_mappings?solr_node_id=1)

source: Delete existing mappings
fr: Supprimer les correspondances existantes

source: Delete all existing mappings for this Solr node before importing
fr: Supprimer toutes les correspondances existantes pour ce nœud Solr avant de démarrer l'import

source: Solr node created.
fr: Nœud Solr créé.

source: Solr node updated.
fr: Nœud Solr mis à jour.

source: Format (deprecated)
fr: Format (obsolète)

source: Formatter
fr: Formateur

source: Strip HTML tags
fr: Supprimer les balises HTML

source: Convert resource to string
fr: Convertir la ressource en chaîne

source: Resource field
fr: Champ de ressource

source: Convert to Solr date range
fr: Convertir en plage de dates Solr

source: Exclude unmatching values
fr: Exclure les valeurs sans correspondance

source: Filter by data type
fr: Filtrer par type de données

source: Only selected data types will be used. Selecting none is the same as selecting all. Only relevant when the source is a property.
fr: Seuls les types de données sélectionnés seront utilisés. En sélectionner aucun équivaut à tout sélectionner. Uniquement pertinent lorsque la source est une propriété.

source: Filter resources by class
fr: Filtres par type de ressource

source: Resource classes
fr: Type de ressource

source: The URI cannot be empty
fr: L'URI ne peut pas être vide

source: Another Solr node already uses this URI
fr: Un autre nœud Solr utilise déjà cette URI
