Repository: biblibre/omeka-s-module-Solr
Catalog: documentation/locales/*/LC_MESSAGES/development.po
Languages: fr

source: Server event reference
fr: Référence d'évènement serveur

source: Triggered right before the document is sent to Solr.
fr: Déclenché juste avant que le document soit envoyé à Solr.

source: Event's target is a ``Solr\SolrInputDocument``. Can be modified.
fr: La cible de l'évènement est un ``Solr\SolrInputDocument``. Peut être modifié.

source: Parameters
fr: Paramètres

source: The resource being indexed
fr: La ressource étant indexée

source: The solr node where the document is being sent
fr: Le nœud Solr où le document est envoyé

source: Example
fr: Exemple

source: Triggered right before the query is sent to Solr.
fr: Déclenché juste avant que la requête soit envoyée à Solr.

source: Event's target is a ``Solr\SolrQuery``. Can be modified.
fr: La cible de l'évènement est un ``Solr\SolrQuery``. Peut être modifié.

source: The original search query
fr: La requête originale

source: The solr node about to be queried
fr: Le nœud Solr étant requêté
