Repository: biblibre/omeka-s-module-Solr
Catalog: documentation/locales/*/LC_MESSAGES/index.po
Languages: fr

source: User documentation
fr: Documentation utilisateur

source: Developer documentation
fr: Documentation développeur

source: Solr module for Omeka S
fr: Module Solr pour Omeka S

source: This module provides a `Search <https://github.com/biblibre/omeka-s-module-Search>`_ adapter for `Solr <https://lucene.apache.org/solr/>`_.
fr: Ce module fournit un adaptateur `Search <https://github.com/biblibre/omeka-s-module-Search>`_ pour `Solr <https://lucene.apache.org/solr/>`_.

source: Features
fr: Fonctionnalités

source: Search among items and item sets
fr: Recherche parmi les contenus et collections

source: Highlighting (show fragments of documents that match the user’s query)
fr: Mise en évidence (`highlighting`, affiche des fragments de documents correspondant à la requête de l'utilisateur)

source: Customizable facets and sort options
fr: Facettes et options de tri personnalisables

source: Customizable mappings
fr: Correspondances (`mappings`) personnalisables

source: Extensible by other modules:
fr: Extensible par d'autres modules:

source: Custom transformations (modifications applied to a value before being added to a Solr document)
fr: Transformations (modifications appliquées à une valeur avant d'être ajoutée à un document Solr)

source: Custom value extractors (make module-specific data related to resources available to the indexer)
fr: Extracteurs de valeur (rend des données spécifiques à un module accessible pour l'indexeur)

source: Solr documents can be altered right before being sent to Solr
fr: Les documents Solr peuvent être modifiés juste avant d'être envoyés à Solr

source: Solr query can be altered right before being sent to Solr
fr: La requête Solr peut être modifiée juste avant d'être envoyée à Solr

source: Compatible with the module `Group <https://omeka.org/s/modules/Group>`_ (can return private resources if they belong to user's groups)
fr: Compatible avec le module `Group <https://omeka.org/s/modules/Group>`_ (peut renvoyer des ressources privées si elles appartiennent aux groupes de l'utilisateur)
