Repository: biblibre/omeka-s-module-Solr
Catalog: documentation/locales/*/LC_MESSAGES/user.po
Languages: fr

source: To be written later...
fr: À rédiger plus tard...

source: Quick start
fr: Démarrage rapide

source: Install the `Search <https://omeka.org/s/modules/Search>`_ module
fr: Installer le module `Search <https://omeka.org/s/modules/Search>`_

source: Install this module
fr: Installer ce module

source: In the administration menu, click on "Solr"
fr: Dans le menu d'administration, cliquer sur "Solr"

source: Edit the default node and set the URI of your Solr instance.
fr: Modifier le nœud par défaut et définir l'URI de l'instance Solr.

source: Go to the mappings section of the default node (the icon next to the edit icon)
fr: Aller dans la section "correspondance" du nœud par défaut (l'icône à côté de l'icône de modification)

source: Create an item mapping with ``dcterms:title`` as source and ``dcterms_title_txt`` as Solr field
fr: Créer une correspondance de contenu avec ``dcterms:title`` comme source et ``dcterms_title_txt`` comme champ Solr

source: Edit the Solr node again and type ``dcterms_title_txt`` in "Query fields (qf)"
fr: Modifier à nouveau le nœud Solr et saisir ``dcterms_title_txt`` dans "Champs de requête (qf)"

source: In Search admin pages:
fr: Dans les pages d'admin de Search:

source: Add a new index using the Solr adapter
fr: Ajouter un nouvel index utilisant l'adaptateur Solr

source: Launch the indexation by clicking on the "reindex" button (two arrows forming a circle)
fr: Lancer l'indexation en cliquant sur le bouton "reconstruire l'index" (deux flèches formant un cercle)

source: Add a page using the created index
fr: Ajouter une page utilisant l'index créé

source: In page configuration, you can enable/disable facet and sort fields (more fields can be created by going to the Solr admin page)
fr: Dans la configuration de la page, vous pouvez activer/désactiver les champs de facette et de tri (plus de champs peuvent être créés en allant sur la page d'admin Solr)

source: In your site configuration, add a navigation link to the search page
fr: Dans la configuration du site, ajouter un lien de navigation vers la page de recherche

source: Go to your site, then click on the navigation link you just added.
fr: Aller sur le site, puis cliquer sur le lien de navigation nouvellement ajouté.

source: The search form should appear. Type some text then submit the form to display the results.
fr: Le formulaire de recherche doit apparaître. Saisir du texte et soumettre le formulaire pour afficher les résultats.
